# Tidy Tuesday - Olympics

## Initial Check

In [1]:
library(dplyr)
library(ggplot2)

Registered S3 methods overwritten by 'tibble':
  method     from
  format.tbl pillar
  print.tbl  pillar

Attaching package: ‘dplyr’

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

Registered S3 methods overwritten by 'ggplot2':
  method         from
  [.quosures     rlang
  c.quosures     rlang
  print.quosures rlang

In [2]:
df_olympics <- read.csv('https://raw.githubusercontent.com/rfordatascience/tidytuesday/master/data/2021/2021-07-27/olympics.csv')

In [3]:
head(df_olympics)
dim(df_olympics)
df_olympics[1,]

  id name                     sex age height weight team           noc
1 1  A Dijiang                M   24  180    80     China          CHN
2 2  A Lamusi                 M   23  170    60     China          CHN
3 3  Gunnar Nielsen Aaby      M   24   NA    NA     Denmark        DEN
4 4  Edgar Lindenau Aabye     M   34   NA    NA     Denmark/Sweden DEN
5 5  Christine Jacoba Aaftink F   21  185    82     Netherlands    NED
6 5  Christine Jacoba Aaftink F   21  185    82     Netherlands    NED
  games       year season city      sport
1 1992 Summer 1992 Summer Barcelona Basketball
2 2012 Summer 2012 Summer London    Judo
3 1920 Summer 1920 Summer Antwerpen Football
4 1900 Summer 1900 Summer Paris     Tug-Of-War
5 1988 Winter 1988 Winter Calgary   Speed Skating
6 1988 Winter 1988 Winter Calgary   Speed Skating
  event                              medal
1 Basketball Men's Basketball        NA
2 Judo Men's Extra-Lightweight       NA
3 Football Men's Football            NA
4 Tug-Of-War Men's Tug-Of-War        Gold
5 Speed Skating Women's 500 metres   NA
6 Speed Skating Women's 1,000 metres NA

[1] 271116     15

  id name      sex age height weight team  noc games       year season
1 1  A Dijiang M   24  180    80     China CHN 1992 Summer 1992 Summer
  city      sport      event                       medal
1 Barcelona Basketball Basketball Men's Basketball NA

In [4]:
df_olympics %>% select(year) %>% unique() %>% count()

  n
1 35

In [6]:
df_olympics %>% select(sport) %>% unique() %>% head()

   sport
1  Basketball
2  Judo
3  Football
4  Tug-Of-War
5  Speed Skating
11 Cross Country Skiing

In [8]:
df_olympics %>% 
    group_by(year) %>% 
    summarise(
        sport_count = n_distinct(sport),
        noc_count =  n_distinct(noc),
        team_count =  n_distinct(team), ## I assume it has 1-1 relationship with NOC -- apparently not! is the data dirty?
        participant_count = n_distinct(name)
    )

   year sport_count noc_count team_count participant_count
1  1896  9           12        18          176
2  1900 20           31       190         1220
3  1904 18           15        79          650
4  1906 13           21        52          841
5  1908 24           22        73         2024
6  1912 17           29       102         2409
7  1920 25           29        72         2675
8  1924 30           46        93         3565
9  1928 25           46        85         3702
10 1932 25           47        72         2174
11 1936 32           50       132         5138
12 1948 29           61       131         5068
13 1952 27           69       155         5621
14 1956 27           75       149         4166
15 1960 27           84       196         6012
16 1964 31           94       199         6226
17 1968 30          112       145         6711
18 1972 33          121       157         8111
19 1976 33           93       126         7194
20 1980 33           90       111         6323
21 1984 35          148       179         8057
22 1988 37          160       211         9860
23 1992 41          170       239        11172
24 1994 12           67       101         1738
25 1996 31          197       246        10324
26 1998 14           72       106         2178
27 2000 34          200       243        10639
28 2002 15           77       114         2397
29 2004 34          201       260        10537
30 2006 15           79       113         2494
31 2008 34          204       292        10880
32 2010 15           82       116         2535
33 2012 32          205       245        10502
34 2014 15           89       119         2744
35 2016 34          207       249        11174

# Exploration

- [ ] Number of events held so far
    - [ ] location: host city, continent?
        - [ ] summer or winter?
- [ ] Number of sports or competitions over time
    - [ ] number of countries that participated in each sport
- [ ] age distribution of the participants
    - [ ] split by country
    - [ ] by gender
- [ ] male vs. female participants compositions per country
    - [ ] success rate (i.e., medal achievement)
- [ ] Number of participants who
    - [ ] participate in > 1 olympics event
    - [ ] participate in > 1 sport in one event
    - [ ] get multiple medals in one event
- [ ] Focus on SEA region; compare participations and results of INA vs. others

In [3]:
# Indonesia
df_olympics %>% filter(noc == 'INA') %>% nrow()

Attaching package: ‘dplyr’

The following objects are masked from ‘package:stats’:

    filter, lag

The following objects are masked from ‘package:base’:

    intersect, setdiff, setequal, union

Registered S3 methods overwritten by 'ggplot2':
  method         from
  [.quosures     rlang
  c.quosures     rlang
  print.quosures rlang

[1] 412